docs/benchmark-results/sync-vs-async/raw/stage1-async-nobatch-k6-logs/insert-update-vu50.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/large-db-insert-then-update-async.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 10m30s max duration (incl. graceful stop):
              * insert_then_update_async: 200 iterations for each of 50 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=1.64ms min=0s med=1ms    max=35.31ms p(90)=3.49ms p(95)=4.68ms 
      { expected_response:true }...: avg=1.64ms min=0s med=1ms    max=35.31ms p(90)=3.49ms p(95)=4.68ms 
    http_req_failed................: 0.00%  0 out of 20000
    http_reqs......................: 20000  23354.614837/s

    EXECUTION
    iteration_duration.............: avg=4.06ms min=0s med=3.01ms max=37.45ms p(90)=8.19ms p(95)=11.03ms
    iterations.....................: 10000  11677.307418/s

    NETWORK
    data_received..................: 1.5 MB 1.7 MB/s
    data_sent......................: 3.0 MB 3.5 MB/s



running (00m00.9s), 00/50 VUs, 10000 complete and 0 interrupted iterations
insert_then_update_async ✓ [ 100% ] 50 VUs  00m00.9s/10m0s  10000/10000 iters, 200 per VU